def numb(prompt):
    while True:
        try:
            return float(input(prompt))
        except ValueError:
            print("Ошибка: пожалуйста, введите корректное число.")

print("Выберите конвертер:")
print("1. Градус Цельсия -> Градус Фаренгейта")
print("2. Километры -> Мили")
print("3. Килограммы -> Фунты")
print("4. Метры -> Футы")

v = input("Ваш выбор: ").strip()

if v == "1":
    n1 = numb("Введите температуру: ")
    print(f"{n1} C = {(n1 * 9 / 5) + 32} F")
elif v == "2":
    n2 = numb("Введите количество км: ")
    print(f"{n2} км = {n2 / 1.609344} миль")
elif v == "3":
    n3 = numb("Введите количество кг: ")
    print(f"{n3} кг = {n3 * 2.20462262185} фунтов")
elif v == "4":
    n4 = numb("Введите количество м: ")
    print(f"{n4} м = {n4 * 3.28084} футов")
else:
    print("Ошибка: неизвестный номер преобразования. Пожалуйста, выберите от 1 до 4.")